app/controllers/reviews_controller.rb

SELECT "reviews".* FROM "reviews"
---
  def index
    # viewのform_forにモデルの情報を渡す
      @review = Review.new
    # dbから全てのデータを取り出す
      @reviews = Review.all

INSERT INTO "reviews" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "dddd"], ["body", "ggggg"], ["created_at", "2019-05-14 15:47:26.626702"], ["updated_at", "2019-05-14 15:47:26.626702"]]
---
  def create
    # 入力された情報を受け取ってdbに渡す,ローカル変数
      review = Review.new(review_params)
      if review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
---
  def show
      @review = Review.find(params[:id])

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
      @review = Review.find(params[:id])

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "reviews" SET "body" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["body", "888888"], ["updated_at", "2019-05-15 05:24:16.392172"], ["id", 3]]
---
  def update
      review = Review.find(params[:id])
      if review.update(review_params)

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 16]]
---
  def destroy
      review = Review.find(params[:id])
      review.destroy